# RevisionSettingsDuplicateName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionFailures..::..RevisionSettingsDuplicateName Property
BuiltInFailures..::..RevisionFailures Class See Also
---
More than one Revisons have the same name %1!s!.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RevisionSettingsDuplicateName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevisionSettingsDuplicateName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RevisionSettingsDuplicateName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevisionFailures Class
Autodesk.Revit.DB Namespace